from test_model import TestModel

tester = TestModel("../../../Charge/ModelVsAPI/1")
a = tester.test_sentence("یه شارژ 50 تومنی واسم بخر")
a = tester.test_sentence("عشقم واسم یه شارژ 5 تومنی اینترنت ایرانسل میگیری برام فدات شم")
a = tester.test_sentence("جون دل شارژ 20 میلیون ریالی همراه اول از حساب 5859831022518434 واسه شماره 09173771786 بخر")
a = tester.test_sentence("آقا لطفا از حساب ملی من برای موبایل 22663377 شارژ رایتل شگفت انگیز 50 تومنی بخر")
a = tester.test_sentence("برای شماره سبا شارژ اینترنت 50 تومنی کارت به کارت کن از کارت 59595949549")
a = tester.test_sentence("لطفا شارژ رایتل شگفت انگیز به مبلغ 50 تومن از حساب 5868 بگیر واسم برای شماره تلفن همراه آرمین خیاطی")
a = tester.test_sentence("شارژ شگفت انگیز ایرنسل 50 هزار تومنی")
a = tester.test_sentence("برای شماره 0918383838 از حساب 9494949 شارژ 90 تومنی همراه اول کارت به کارت کن")
a = tester.test_sentence("واسم شارژ همراه اول 50 تومنی بخر از کارت 84949494 برای خط سبا")
a = tester.test_sentence("واسم شارژ همراه اول 50 تومنی بخر از کارت     84949494 برای خط سبا")
