import random

ALPHABET = ["ا", "ب", "پ", "ت", "ث", "ج", "چ", "ح", "خ", "د", "ذ", "ر", "ز", "ژ", "س", "ش", "ص", "ض", "ط", "ظ", "ع", "غ", "ف", "ق", "ک", "ل", "م", "ن", "و", "ه", "ی",]

ALL_WORDS = [
    ####
    "سلام", "یک", "موجودی", "حساب", "کارت", "یه", "موجود", "بالانس", "رو", "را", "به", "شماره", "نام",
    "چقدر", "چند", "ته", "با", "کل", "پول","نگاه","بنداز", "ببین",
    "کارتم", "حسابم", "کارت من", "حساب من",
"موجودی", "بالانس", "پول", "مبلغ" , "مانده", "انباشته", "ذخیره",

    ####
    "برای", "برا", "واس", "واسه", "سی",
    "برایم", "برام", "واسم", "واسهم", "سیم",
    ####
    "من", "خودم", "م", "بنده", "مو", "خوم",
    ####
    "از", "با", "توسط", "بوسیله", "به وسیله",
    ####
    "میخوام", "میخواستم", "می خوام", "می خواستم", "میخوایم", "میخواید",
    "می خوایم", "می خواید", "میخواستیم", "می خواستیم", "قصد دارم", "قصد داریم", "قصدش داریم",
    ####
    "بگیر", "بگیرید", "بگیرین", "میگیری", "میگیرید", "میگیرین", "بگیرم", "بگیرن",
    "می گیری", "می گیرید", "می گیرین", "بگیریم",
    ####
    "بخرید", "بخر", "بخرین", "میخرید", "میخرین", "میخری", "بخریم", "بخرم", "بخری" ,
    "می خرید", "می خرین", "می خری",
    ####
    "میخوام", "میخواستم", "می خوام", "می خواستم", "میخوایم", "میخواید", "می خوایم", "می خواید",
    "میخواستیم", "می خواستیم",
    ####
    "بریزید", "بریزین",
    "بده", "بدهید", "بدهین",
    "بگو", "بگویید",
    "چقدره", "چقدر هست", "چنده", "چند هست", "میشه","در بیار", "در بیاورید",
    "در میاری", "در میارید", "در میاورید", "در می آورید",
    ####
    "کنید", "بکن", "بکنید", "بکنین", "بکنم", "بکنیم", "میکنین", "کنم", "کنی",
    ####
    "کنین", "میکنی", "میکنین", "میکنید", "می کنی", "می کنین", "می کنید", "کن",
    ####
    "در", "تو", "داخل", "توی", "از", "درون",
    ####
    "لطفا", "خواهشا", "خواهشمندم", "تو رو خدا", "جان مادرت", "خواهش میکنم", "خواهش می کنم",
    "جان بچت", "ممنون میشم", "ممنون می شم", "جون دیت", "جون مادرت", "جون بچت", "تقاضا میکنم", "تقاضا می کنم",
    "جون مادرت", "ممنون می شوم", "ممنون میشوم", "هر کاری بگی می کنم فقط", "هر کاری بگی میکنم فقط",
    ####

    ####
    "<sos>", "<eos>", "تا",

]









###############################SLOTS Value Generators################################
###################### Value generators for slot placeholders #######################
###################### Write SLOT Value Generators for your own task #######################

def account_number_generator():
    if random.random() < 0.5:
        a = random.randint(1000, 9999)
        b = random.randint(1000, 9999)
        c = random.randint(1000, 9999)
        d = random.randint(1000, 9999)
        return str(a) + str(b) + str(c) + str(d)
    else:
        words = random.randint(1, 3)
        name = ""
        first = True
        while(words>0):
            if not first:
                name = name + " "
            a = random.choices(ALPHABET, k=random.randint(3, 10))
            name = name + "".join(a)
            first = False
            words = words - 1
        return name


def accoutn_type_generator():
    values = ["کارت", "حساب", "کارتم", "حسابم", "کارت من", "حساب من"]
    return random.choice(values)

###################################### WORD FILLER ######################################
###################### Value generators for non slot placeholders #######################
###################### Write Word fillers for your own task #######################
def for_filler():
    values = ["برای", "برا", "واس", "واسه", "سی", ]
    return random.choice(values)

def me_filler():
    values = ["من", "خودم", "م", "بنده", "مو", "خوم"]
    a = random.choice(values)
    if a != "م":
        a = " " + a
    return a

def from_filler():
    values = ["از", "با", "توسط", "بوسیله", "به وسیله"]
    return random.choice(values)

def please_filler():
    values = ["لطفا", "خواهشا", "خواهشمندم", "تو رو خدا", "جان مادرت", "خواهش میکنم", "خواهش می کنم",
              "جان بچت", "ممنون میشم", "ممنون می شم", "جون دیت", "جون مادرت", "جون بچت", "تقاضا میکنم", "تقاضا می کنم",
              "جون مادرت", "ممنون می شوم", "ممنون میشوم", "هر کاری بگی می کنم فقط", "هر کاری بگی میکنم فقط", ]
    return random.choice(values)

def in_filler():
    values = ["در", "تو", "داخل", "توی", "از", "درون"]
    return random.choice(values)

def verb_filler():

    verb = ""
    pre_values = ["میخوام", "میخواستم", "می خوام", "می خواستم", "میخوایم", "میخواید"
        , "می خوایم", "می خواید", "میخواستیم", "می خواستیم", "قصد دارم", "قصد داریم", "قصدش داریم",
        ]
    values = [
        ####
        "بگیر", "بگیرید", "بگیرین", "میگیری", "میگیرید", "میگیرین", "بگیرم", "بگیرن",
        "می گیری", "می گیرید", "می گیرین", "بگیریم",
        ####
              "میخوام", "میخواستم", "می خوام", "می خواستم", "میخوایم", "میخواید", "می خوایم", "می خواید",
              "میخواستیم", "می خواستیم"
        ####
              "کنید", "بکن", "بکنید", "بکنین", "بکنم", "بکنیم", "میکنین", "کنم", "کنی",
        ####
              "کنین", "میکنی", "میکنین", "میکنید", "می کنی", "می کنین", "می کنید", "کن",
        ####
              "تهیه کن", "تهیه کنیم", "تهیه کنم", "تهیه بکنیم", "تهیه بکنم", "تهیه بکن",
        ####
        "قصد دارم", "قصد داریم", "قصدش داریم",
        "بده", "بدهید", "بدهین",
        "بگو", "بگویید","چقدره", "چقدر هست", "چنده", "چند هست", "میشه", "در بیار", "در بیاورید",
        "ببین",
        "در میاری", "در میارید", "در میاورید", "در می آورید",
              ]

    if random.random() > 0.5:
        verb = verb + random.choice(pre_values) + " "
    verb = verb + random.choice(values)
    return verb


def bank_filler():
    words = random.randint(1, 3)
    name = ""
    first = True
    while (words > 0):
        if not first:
            name = name + " "
        a = random.choices(ALPHABET, k=random.randint(3, 10))
        name = name + "".join(a)
        first = False
        words = words - 1
    return name

def balance_filler():
    values = ["موجودی", "بالانس", "پول", "مبلغ" , "مانده", "انباشته", "ذخیره"]
    return random.choice(values)

###################### Main functions to generate values #######################
###################### Copy Paste them into your task util #######################

def get_word_or_slot_value(w):
    if w in WORD_FILLER.keys():
        return ["O"], [WORD_FILLER[w]()]
    else:
        return [w], [SLOT[w]()]

def is_slot(w):
    if w in SLOT.keys():
        return True
    else:
        return False

def get_all_words():
    all_words = []
    for words in ALL_WORDS:
        for w in words.split(" "):
            all_words.append(w)
    all_words = list(set(all_words))
    return sorted(all_words)


###################### Reinitial these dictionaries based #######################
###################### on your task word fillers and slots #######################


WORD_FILLER = {
    # # Word Filling
    "for": for_filler,
    "me": me_filler,
    "from": from_filler,
    "please": please_filler,
    "in": in_filler,
    "balance": balance_filler,
    "bank": bank_filler,

}

SLOT = {
    # Slots
    "account":  account_number_generator,
    "atype" : accoutn_type_generator,
    "verb": verb_filler,
}













